// utils/constants.js
export const LOCAL_GOV_LIST = [
  "경상남도", "서울특별시", "부산광역시", "대구광역시", "인천광역시", "광주광역시",
  "대전광역시", "울산광역시", "세종특별자치시", "경기도", "강원특별자치도",
  "충청북도", "충청남도", "전북특별자치도", "전라남도", "경상북도", "제주특별자치도"
];

export const GRADE_EXCLUDE = ["", "실시완료", "실시완료(등급미상)", "해당없음", "기타"];

export const HEADER_PLAN = [
  '구분', '관리계획 수립기관', '작성기관', '시설종류', '제출일시', '담당자', '결재현황', '결재이력', '결재-담당자'
];

export const HEADER_DB = [
  '관리번호', '기반시설물명', '시설물종별', '기반시설구분', '시설물구분', '시설물종류',
  '관리감독기관', '관리계획 수립기관', '관리주체', '관리주체 하위조직', '기관상세', '준공일', '등급'
];

export const HEADER_ORDINANCE = [
  '구분', '관리계획 수립기관', '작성기관', '시설종류', '충당금 조례 제정 여부'
];

export const HEADER_NOTICE = [
  '시설종류', '시설물종류', '시설물안전법 1종', '시설물안전법 2종', '시설물안전법 3종', '시설물안전법 기타',
  '비대상', 'A', 'B', 'C', 'D', 'E', '우수', '양호', '보통', '미흡', '불량'
];
